<?php 
return [
    [
        'type'      => 1,
        'question'  => 'اختر هدفك',
        'responds'  => [
            [
                'text'  => 'فقدان الوزن',
                'img'   => 'image1.jpg',
            ],
            [
                'text'  => 'تحسين القدرة على التحمل',
                'img'   => 'image2.jpg',
            ],
            [
                'text'  => 'اكتساب كتلة العضلات',
                'img'   => 'image3.jpg',
            ]
        ]
    ],
    [
        'type'      => 2,
        'question'  => 'أختر الجسم الذي تريده',
        'responds'  => [
            [
                'text'  => 'جسم نحيف',
                'img'   => 'slim.jpg',
            ],
            [
                'text'  => 'جسم نحيف عضلى',
                'img'   => 'slim-shredded.jpg',
            ],
            [
                'text'  => ' فورمة الساحل',
                'img'   => 'beach-body.jpg',
            ],
            [
                'text'  => ' جسم رياضى',
                'img'   => 'workout.jpg',
            ],
            [
                'text'  => 'جسم الكروس فيت',
                'img'   => 'cross-fit.jpg',
            ],
            [
                'text'  => 'رياضى',
                'img'   => 'athlete.jpg',
            ],
            [
                'text'  => 'بطل',
                'img'   => 'hero.jpg',
            ],
            [
                'text'  => 'كمال اجسام',
                'img'   => 'bodybuilder.jpg',
            ]
        ]
    ],
    [
        'type'      => 3,
        'question'  => ' ضع علامة على أهدافك الأضافية أدناه',
        'btn'       => 'متابعة',
        'none'      => 'لا شيئ مما سبق',
        'responds'  => [
            [
                'text'  => 'تحسين النوم'
            ],
            [
                'text'  => ' تكوين عادات جسدية'
            ],
            [
                'text'  => 'اللإنضباط الذاتى'
            ],
            [
                'text'  => ' تمتع بمزيد من الصحه'
            ],
            [
                'text'  => 'الحد من التوتر'
            ]
        ]
    ],
    [
        'type'      => 1,
        'question'  => 'اختر نمط جسمك الحالى',
        'responds'  => [
            [
                'text'  => 'النمط النحيف',
                'desc'  => 'جسم نحيف اطراف طويله نحيفه بمعدل التمثيل الغذائى عالى',
                'img'   => 'ectomorph.jpg',
            ],
            [
                'text'  => 'النمط العضلى',
                'desc'  => 'نمط عضلى بناء جيد ومعدل التمثيل الغذائى طبيعى',
                'img'   => 'mesomorph.jpg',
            ],
            [
                'text'  => 'النمط السمين',
                'desc'  => 'جسم مرتخى ومستدير بمعدل تمثيل غذائى بطيئ',
                'img'   => 'endomorph.jpg',
            ]
        ]
    ],
    [
        'type'      => 4,
        'question'  => 'اختر نسبة الدهون فى جسمك',
        'btn'       => 'متابعة',
        'defaultIndex'   => 0,
        'allowImg'  => true,
        'responds'  => [
            [
                'text'  => '5-9%',
                'img'   => '0.jpg'
            ],
            [
                'text'  => '10-14%',
                'img'   => '1.jpg'
            ],
            [
                'text'  => '15-19%',
                'img'   => '2.jpg'
            ],
            [
                'text'  => '20-24%',
                'img'   => '3.jpg'
            ],
            [
                'text'  => '25-29%',
                'img'   => '4.jpg'
            ],
            [
                'text'  => '30-34%',
                'img'   => '5.jpg'
            ],
            [
                'text'  => '35-39%',
                'img'   => '6.jpg'
            ],
            [
                'text'  => '>40%',
                'img'   => '7.jpg'
            ],
        ]
    ],
    [
        'type'      => 3,
        'question'  => 'حدد نقاط الضعف',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => 'صدر ضعيف',
                'img'   => 'weak-chest.jpg'
            ],
            [
                'text'  => 'أذرع نحيفه',
                'img'   => 'slim-arms.jpg'
            ],
            [
                'text'  => 'بطن البيرة',
                'img'   => 'beer-tummy.jpg'
            ],
            [
                'text'  => 'أرجل نحيفه',
                'img'   => 'slim-legs.jpg'
            ]
        ]
    ],
    [
        'type'      => 5,
        'input'     => 'date',
        'question'  => "ماهو تاريخ ميلادك؟",
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => []
    ],
    [
        'type'      => 5,
        'input'     => 'text',
        'question'  => "ماهو أسمك ؟",
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => []
    ],
    [
        'type'      => 6,
        'question'  => "أدخل الطول و الوزن ",
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => []
    ],
    [
        'type'      => 5,
        'label'     => 'الوزن المطلوب (كجم)',
        'input'     => 'number',
        'question'  => "ما هو الوزن المطلوب ؟",
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => []
    ],
    [
        'type'      => 4,
        'question'  => "ماهو مستواك فى اللياقه البدنية؟ ",
        'btn'       => 'متابعة',
        'defaultIndex'   => 4,
        'allowImg'  => false,
        'responds'  => [
            [
                'text'  => '1'
            ],
            [
                'text'  => '2'
            ],
            [
                'text'  => '3'
            ],
            [
                'text'  => '4'
            ],
            [
                'text'  => '5'
            ],
            [
                'text'  => '6'
            ],
            [
                'text'  => '7'
            ],
            [
                'text'  => '8'
            ],
            [
                'text'  => '9'
            ],
            [
                'text'  => '10'
            ]
        ]
    ],
    [
        'type'      => 3,
        'question'  => 'ماهى الرياضه التى تهتم بها ؟',
        'btn'       => 'متابعة',
        'none'      => 'لا شيئ مما سبق',
        'responds'  => [
            [
                'text'  => 'التمرين فى الجيم'
            ],
            [
                'text'  => 'التمرين فى المنزل'
            ],
            [
                'text'  => 'الملاكمة'
            ],
            [
                'text'  => 'فنون قتالية أخرى'
            ],
            [
                'text'  => 'الهرولة'
            ]
        ]
    ],
    [
        'type'      => 3,
        'question'  => ' هل واجهت أيًا من هذه المشكلات في محاولاتك السابقة للياقة البدنية؟',
        'btn'       => 'متابعة',
        'none'      => 'لا شيئ مما سبق',
        'responds'  => [
            [
                'text'  => ' عدم وجود الحافز '
            ],
            [
                'text'  => " لم يكن لديكم خطة واضحة "
            ],
            [
                'text'  => ' كانت التدريبات الخاصة بي صعبة للغاية '
            ],
            [
                'text'  => ' تدريب سيء '
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم عدد تمارين الضغط التي يمكنك القيام بها في جولة واحدة؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => ' اقل من 10'
            ],
            [
                'text'  => "10الى 20"
            ],
            [
                'text'  => '21 الى 30'
            ],
            [
                'text'  => 'أكثر من 30'
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم عدد " العقلة" التي يمكنك القيام بها في جولة واحدة؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => ' لا يمكنني القيام بعمل واحدة '
            ],
            [
                'text'  => "أقل من 5"
            ],
            [
                'text'  => '5 الى 10'
            ],
            [
                'text'  => 'أكثر من 10'
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => 'اختر مكان التدريب',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => "المنزل"
            ],
            [
                'text'  => 'الجيم'
            ],
            [
                'text'  => 'فى الهواء الطلق'
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' ما نوع المعدات التي يمكنك الوصول إليها؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " لا توجد معدات "
            ],
            [
                'text'  => ' المعدات الأساسية ',
                'desc'  => ' شريط المقاومة ، الدمبل '
            ],
            [
                'text'  => ' معدات كاملة ',
                'desc'  => ' شريط المقاومة ، الدمبل ، القضبان المتوازية والزجزاج '
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم مرة تدربت في الأسبوع خلال الأشهر الثلاثة الماضية؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " على الاطلاق ",
                'desc'  => " لم أتدرب ، لكنني سأفعل بعد الحصول على برنامج التمرين!"
            ],
            [
                'text'  => '1-2 مرات في الأسبوع '
            ],
            [
                'text'  => ' مرات في الأسبوع 3 '
            ],
            [
                'text'  => ' أكثر من 3 مرات في الأسبوع '
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم من الوقت أنت على استعداد لقضاء التمرين؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " دقيقة 15"
            ],
            [
                'text'  => '30دقيقة '
            ],
            [
                'text'  => 'ساعه'
            ],
            [
                'text'  => ' يقرر Diet club دع '
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم تشرب من الماء يوميا؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " فقط القهوة أو الشاي "
            ],
            [
                'text'  => ' أقل من كوبين '
            ],
            [
                'text'  => ' أكواب 2-6'
            ],
            [
                'text'  => '7-10 أكواب'
            ],
            [
                'text'  => 'أكثر من 10 أكواب'
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' كم من الوقت أنت مستعد لتوفيره لتحضير وجبة واحدة؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " أقل من 30 دقيقة "
            ],
            [
                'text'  => '30-60دقيقة '
            ],
            [
                'text'  => 'أكثر من ساعه'
            ]
        ]
    ],
    [
        'type'      => 7,
        'question'  => ' هل أنت مستعد لتحدي التمرين؟',
        'btn'       => 'متابعة',
        'required'  => true,
        'responds'  => [
            [
                'text'  => " لا عذر!",
                'desc'  => " لن أتخطى أيًا من التدريبات الخاصة بي خلال الأشهر الستة المقبلة "
            ],
            [
                'text'  => ' 30يومًا بدون الوجبات السريعة!'
            ],
            [
                'text'  => 'قم بـ 80 تمرين ضغط في جولة واحدة!'
            ],
            [
                'text'  => ' سأواجه كل التحديات!'
            ]
        ]
    ],
];
